## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 3 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.postgres_password[&#34;crowd&#34;]
  * azurerm_key_vault_secret.postgres_username[&#34;crowd&#34;]
  * random_password.postgres_password[&#34;crowd&#34;]
  * terraform_data.postgres[&#34;crowd&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-crowd-01&#34;]
* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_server.atlassian-server
* Replace
  * terraform_data.vm[&#34;atlassian-nonprod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-03&#34;]
* Move
  * terraform_data.jira_vm[&#34;atlassian-nonprod-jira-01&#34;] => terraform_data.vm[&#34;atlassian-nonprod-jira-01&#34;]
  * terraform_data.jira_vm[&#34;atlassian-nonprod-jira-02&#34;] => terraform_data.vm[&#34;atlassian-nonprod-jira-02&#34;]
  * terraform_data.jira_vm[&#34;atlassian-nonprod-jira-03&#34;] => terraform_data.vm[&#34;atlassian-nonprod-jira-03&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (17 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.postgres_password["crowd"] will be created
  + resource "azurerm_key_vault_secret" "postgres_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "crowd-db-nonprod-postgres-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.postgres_username["crowd"] will be created
  + resource "azurerm_key_vault_secret" "postgres_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "crowd-db-nonprod-postgres-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_server.atlassian-server will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password      = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                              = "atlassian-nonprod-server"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (15 unchanged attributes hidden)
    }

  # random_password.postgres_password["crowd"] will be created
  + resource "random_password" "postgres_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 11
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # terraform_data.postgres["crowd"] will be created
  + resource "terraform_data" "postgres" {
      + id               = (known after apply)
      + triggers_replace = [
          + "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server",
          + (known after apply),
          + (known after apply),
        ]
    }

  # terraform_data.vm["atlassian-nonprod-crowd-01"] will be created
  + resource "terraform_data" "vm" {
      + id               = (known after apply)
      + triggers_replace = [
          + "71f86b7cce89c0de5883f9ff2635988b",
          + "82435b162c9b232d2bc9fbd03dba904f",
          + "f032b97248e6dea1354a80b9a564da0c",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-01"] must be replaced
  # (moved from terraform_data.jira_vm["atlassian-nonprod-jira-01"])
-/+ resource "terraform_data" "vm" {
      ~ id               = "7eab8dae-ebc4-4c3d-120d-3d65067964c0" -> (known after apply)
      ~ triggers_replace = [
          - "df85f73a8b90a9d2d2f672062fa0d1c5",
          + "71f86b7cce89c0de5883f9ff2635988b",
          + "82435b162c9b232d2bc9fbd03dba904f",
            "f032b97248e6dea1354a80b9a564da0c",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-02"] must be replaced
  # (moved from terraform_data.jira_vm["atlassian-nonprod-jira-02"])
-/+ resource "terraform_data" "vm" {
      ~ id               = "21ca3c6a-c39d-a553-9b19-722475d4544b" -> (known after apply)
      ~ triggers_replace = [
          - "df85f73a8b90a9d2d2f672062fa0d1c5",
          + "71f86b7cce89c0de5883f9ff2635988b",
          + "82435b162c9b232d2bc9fbd03dba904f",
            "f032b97248e6dea1354a80b9a564da0c",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-03"] must be replaced
  # (moved from terraform_data.jira_vm["atlassian-nonprod-jira-03"])
-/+ resource "terraform_data" "vm" {
      ~ id               = "be8b0120-34e3-3234-9371-a9b3351c2a3a" -> (known after apply)
      ~ triggers_replace = [
          - "df85f73a8b90a9d2d2f672062fa0d1c5",
          + "71f86b7cce89c0de5883f9ff2635988b",
          + "82435b162c9b232d2bc9fbd03dba904f",
            "f032b97248e6dea1354a80b9a564da0c",
        ]
    }

Plan: 8 to add, 3 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->